main() {
  //dart언어의 시작
  //단축키
  // - 한줄 복사 : opt + shift + 화살표
  // - 한줄 삭제 : cmd + shift + k
  // - 줄 이동 : opt + 화살표

  //console - 작동확인 terminal - 사용자가 작업하는 곳
  //소문자로 시작하는건 function 대문자로 시작하는건 class -ios표준

  print("Hello World!");
  print('Hello World!2');
  //print Ex) 버튼을눌렀을때 잘 하고 있는지 확인하기 위해 사용한다. 그러면 그사이에 문제가 있다고 추적가능
  //앱스토어에 올리는 파일에는 print를 다 지움. 해킹에 취약함
  //console에 출력하는 함수 명령문의 끝은 ;
  //Dart 는 "" , '' 의 구분이 없다.

  print("'안녕하세요'");
  print('내 친구는 나에게 "잘 될거야!"라고 말했습니다.');
  // '안녕하세요' 따음표까지 출력하고 싶을때
  print(1 + 2);
  //"",''없이 print 한건 계산을 해서 출력
  print("1 + 2"); 
  //문자취급 

  //함수의 생성법 함수명(){명령문} , 함수의 사용법 함수명();
}
